In [3]:
import pandas as pd

In [6]:
df = pd.read_excel("C:\\Users\\dell\\OneDrive\\Área de Trabalho\\Revisão_4.xlsx")

df.head()
df = df.drop('Unnamed: 0',axis=1)
df = df.drop(0,axis=0)
df.head()
df.columns=['Nome','Salário','Aumento (%)','Novo Salário']
df = df.drop(['Aumento (%)','Novo Salário'],axis=1)
df.head()

                Nome Salário
1    João dos Santos     900
2     Maria da Silva    1200
3  Manoel das Flores    1500
4   Lambarildo Peixe    2000
5    Sebastião Souza    1400

In [3]:
def novoSalario(x):
    if x['Salário'] < 100:
        return 0.4 
    else:
        return 0.3

In [4]:
df = df.assign(Aumento = df.apply(novoSalario,axis=1))

In [5]:
df.head()

                Nome Salário  Aumento
1    João dos Santos     900      0.3
2     Maria da Silva    1200      0.3
3  Manoel das Flores    1500      0.3
4   Lambarildo Peixe    2000      0.3
5    Sebastião Souza    1400      0.3

In [6]:
df.insert(3,'Novo Salário',0)

In [7]:
df.head()

                Nome Salário  Aumento  Novo Salário
1    João dos Santos     900      0.3             0
2     Maria da Silva    1200      0.3             0
3  Manoel das Flores    1500      0.3             0
4   Lambarildo Peixe    2000      0.3             0
5    Sebastião Souza    1400      0.3             0

In [8]:
df['Novo Salário'] = df['Salário'] * df['Aumento'] + df['Salário']

In [9]:
df.head()

                Nome Salário  Aumento Novo Salário
1    João dos Santos     900      0.3       1170.0
2     Maria da Silva    1200      0.3       1560.0
3  Manoel das Flores    1500      0.3       1950.0
4   Lambarildo Peixe    2000      0.3       2600.0
5    Sebastião Souza    1400      0.3       1820.0

In [11]:
df.to_excel('C:\\Users\\dell\\OneDrive\\Área de Trabalho\\Revisão_4_done.xlsx')